zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SECCON.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SECCON
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_SECCON.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for SECCON
 *
 * CMSIS Peripheral Access Layer for SECCON
 */

#if !defined(PERI_SECCON_H_)
#define PERI_SECCON_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SECCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SECCON_Peripheral_Access_Layer SECCON Peripheral Access Layer
 * @{
 */

/** SECCON - Register Layout Typedef */
typedef struct {
  __IO uint32_t CPU1_RESET_CTRL;                   /**< CPU1 Reset Controller, offset: 0x0 */
  __IO uint32_t CPU1_VECTOR;                       /**< CPU1 Initial Vector Set, offset: 0x4 */
       uint8_t RESERVED_0[60];
  __IO uint32_t GENERAL_BLOCK_0_0;                 /**< GEN_BLK_0_0, offset: 0x44 */
  __IO uint32_t GENERAL_BLOCK_0_1;                 /**< GEN_BLK_0_1, offset: 0x48 */
  __IO uint32_t GENERAL_BLOCK_0_2;                 /**< GEN_BLK_0_2, offset: 0x4C */
  __IO uint32_t GENERAL_BLOCK_0_3;                 /**< GEN_BLK_0_3, offset: 0x50 */
  __IO uint32_t GENERAL_BLOCK_1_0;                 /**< GEN_BLK_1_0, offset: 0x54 */
  __IO uint32_t GENERAL_BLOCK_1_1;                 /**< GEN_BLK_1_1, offset: 0x58 */
  __IO uint32_t GENERAL_BLOCK_1_2;                 /**< GEN_BLK_1_2, offset: 0x5C */
  __IO uint32_t GENERAL_BLOCK_1_3;                 /**< GEN_BLK_1_3, offset: 0x60 */
       uint8_t RESERVED_1[4];
  __IO uint32_t DEVICE_UID_0;                      /**< Device UID 0, offset: 0x68 */
  __IO uint32_t DEVICE_UID_1;                      /**< Device UID 1, offset: 0x6C */
  __IO uint32_t DEVICE_UID_2;                      /**< Device UID 2, offset: 0x70 */
  __IO uint32_t DEVICE_UID_3;                      /**< Device UID 3, offset: 0x74 */
  __IO uint32_t GDET0_CTRL;                        /**< GDET0 Control, offset: 0x78 */
       uint8_t RESERVED_2[16];
  __IO uint32_t CFPA_LC_STATE;                     /**< OEM Life cycle state., offset: 0x8C */
       uint8_t RESERVED_3[16];
  __I  uint32_t LIFECYCLE_STATE;                   /**< Chip LifeCycle State, offset: 0xA0 */
  __I  uint32_t INV_LIFECYCLE_STATE;               /**< Invert version of LIFECYCLE_STATE, offset: 0xA4 */
       uint8_t RESERVED_4[72];
  __IO uint32_t CPU0_DEBUG_EN;                     /**< Debug Feature Registers for CPU0, offset: 0xF0 */
  __IO uint32_t CPU0_DEBUG_EN_DP;                  /**< Debug Feature Registers for CPU0 (duplicate), offset: 0xF4 */
  __IO uint32_t CPU1_DEBUG_EN;                     /**< Debug Feature Registers for CPU1, offset: 0xF8 */
  __IO uint32_t CPU1_DEBUG_EN_DP;                  /**< Debug Feature Registers for CPU1 (duplicate), offset: 0xFC */
  __IO uint32_t DEBUG_AUTH_BEACON;                 /**< Debug Authentication BEACON, offset: 0x100 */
  __IO uint32_t DEBUG_FEATURE_LOCK;                /**< Controls write access to Debug Security registers, offset: 0x104 */
       uint8_t RESERVED_5[16];
  __IO uint32_t SWD_ACCESS_CPU0;                   /**< CPU0 Software Debug Access, offset: 0x118 */
  __IO uint32_t SWD_ACCESS_CPU1;                   /**< CPU1 Software Debug Access, offset: 0x11C */
       uint8_t RESERVED_6[8];
  __IO uint32_t SOC_ERSIEN;                        /**< Flash IFR0 Erase Enable, offset: 0x128 */
       uint8_t RESERVED_7[20];
  __IO uint32_t BOOT_RETRY_CNT;                    /**< Boot Retry Counter, offset: 0x140 */
  __IO uint32_t BOOT_TEMP_STATE;                   /**< Boot Temporal State, offset: 0x144 */
       uint8_t RESERVED_8[56];
  __IO uint32_t BOOT_STATE_0;                      /**< Store boot state, offset: 0x180 */
  __IO uint32_t BOOT_STATE_1;                      /**< Store boot state, offset: 0x184 */
  __IO uint32_t BOOT_STATE_2;                      /**< Store boot state, offset: 0x188 */
  __IO uint32_t BOOT_STATE_LOCK;                   /**< Boot State Register Lock, offset: 0x18C */
  __IO uint32_t ROM_SCRATCH_PAD_0;                 /**< Scratchpad Register 0, offset: 0x190 */
  __IO uint32_t ROM_SCRATCH_PAD_1;                 /**< Scratchpad Register 1, offset: 0x194 */
  __IO uint32_t ROM_API_PARAM;                     /**< ROM API PARAM, offset: 0x198 */
  __IO uint32_t RECOVERY_IMAGE_VECTOR;             /**< RECOVERY IMAGE VECTOR, offset: 0x19C */
  __IO uint32_t LP_WAKEUP_VECTOR;                  /**< LP WAKEUP VECTOR, offset: 0x1A0 */
  __IO uint32_t NXP_PROV_FW_RUN;                   /**< NXP PROV FW RUN, offset: 0x1A4 */
  __IO uint32_t SPI_FLASH_RECOVERY;                /**< SPI FLASH RECOVERY, offset: 0x1A8 */
  __IO uint32_t SPARE;                             /**< SPARE, offset: 0x1AC */
       uint8_t RESERVED_9[140];
  __IO uint32_t CPU0_DEBUG_PRE;                    /**< CPU0 Debug Preparation, offset: 0x23C */
} SECCON_Type;

/* ----------------------------------------------------------------------------
   -- SECCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SECCON_Register_Masks SECCON Register Masks
 * @{
 */

/*! @name CPU1_RESET_CTRL - CPU1 Reset Controller */
/*! @{ */

