zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SECCON.h
#define SECCON_CPU1_RESET_CTRL_CPU1_RESET_MASK   (0xFU)
#define SECCON_CPU1_RESET_CTRL_CPU1_RESET_SHIFT  (0U)
/*! CPU1_RESET - CPU1_RESET
 *  0b1010..Reset CPU1, any other value will clear Reset of CPU1
 */
#define SECCON_CPU1_RESET_CTRL_CPU1_RESET(x)     (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_RESET_CTRL_CPU1_RESET_SHIFT)) & SECCON_CPU1_RESET_CTRL_CPU1_RESET_MASK)

#define SECCON_CPU1_RESET_CTRL_CPU1_VECTOR_LOCK_MASK (0xF00U)
#define SECCON_CPU1_RESET_CTRL_CPU1_VECTOR_LOCK_SHIFT (8U)
/*! CPU1_VECTOR_LOCK - CPU1_VECTOR_LOCK
 *  0b1010..Unlock CPU1_VECTOR, any other value will lock CPU1_VECTOR.
 */
#define SECCON_CPU1_RESET_CTRL_CPU1_VECTOR_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_RESET_CTRL_CPU1_VECTOR_LOCK_SHIFT)) & SECCON_CPU1_RESET_CTRL_CPU1_VECTOR_LOCK_MASK)

#define SECCON_CPU1_RESET_CTRL_CPU1_RESET_CTRL_LOCK_MASK (0xF0000000U)
#define SECCON_CPU1_RESET_CTRL_CPU1_RESET_CTRL_LOCK_SHIFT (28U)
/*! CPU1_RESET_CTRL_LOCK - CPU1_RESET_CTRL_LOCK
 *  0b1010..Unlock CPU1_CTRL_RESET until next warm reset, any other value will lock CPU1_CTRL_RESET.
 */
#define SECCON_CPU1_RESET_CTRL_CPU1_RESET_CTRL_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_RESET_CTRL_CPU1_RESET_CTRL_LOCK_SHIFT)) & SECCON_CPU1_RESET_CTRL_CPU1_RESET_CTRL_LOCK_MASK)
/*! @} */

/*! @name CPU1_VECTOR - CPU1 Initial Vector Set */
/*! @{ */

#define SECCON_CPU1_VECTOR_CPU1_INITVTOR_MASK    (0xFFFFFF80U)
#define SECCON_CPU1_VECTOR_CPU1_INITVTOR_SHIFT   (7U)
/*! CPU1_INITVTOR - CPU1_INITVTOR */
#define SECCON_CPU1_VECTOR_CPU1_INITVTOR(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_VECTOR_CPU1_INITVTOR_SHIFT)) & SECCON_CPU1_VECTOR_CPU1_INITVTOR_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_0_0 - GEN_BLK_0_0 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_0_0_GEN_BLK_0_0_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_0_0_GEN_BLK_0_0_SHIFT (0U)
/*! GEN_BLK_0_0 - GEN_BLK_0 Part 0 */
#define SECCON_GENERAL_BLOCK_0_0_GEN_BLK_0_0(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_0_0_GEN_BLK_0_0_SHIFT)) & SECCON_GENERAL_BLOCK_0_0_GEN_BLK_0_0_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_0_1 - GEN_BLK_0_1 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_0_1_GEN_BLK_0_1_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_0_1_GEN_BLK_0_1_SHIFT (0U)
/*! GEN_BLK_0_1 - GEN_BLK_0 Part 1 */
#define SECCON_GENERAL_BLOCK_0_1_GEN_BLK_0_1(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_0_1_GEN_BLK_0_1_SHIFT)) & SECCON_GENERAL_BLOCK_0_1_GEN_BLK_0_1_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_0_2 - GEN_BLK_0_2 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_0_2_GEN_BLK_0_2_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_0_2_GEN_BLK_0_2_SHIFT (0U)
/*! GEN_BLK_0_2 - GEN_BLK_0 Part 2 */
#define SECCON_GENERAL_BLOCK_0_2_GEN_BLK_0_2(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_0_2_GEN_BLK_0_2_SHIFT)) & SECCON_GENERAL_BLOCK_0_2_GEN_BLK_0_2_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_0_3 - GEN_BLK_0_3 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_0_3_GEN_BLK_0_3_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_0_3_GEN_BLK_0_3_SHIFT (0U)
/*! GEN_BLK_0_3 - GEN_BLK_0 Part 3 */
#define SECCON_GENERAL_BLOCK_0_3_GEN_BLK_0_3(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_0_3_GEN_BLK_0_3_SHIFT)) & SECCON_GENERAL_BLOCK_0_3_GEN_BLK_0_3_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_1_0 - GEN_BLK_1_0 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_1_0_GEN_BLK_1_0_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_1_0_GEN_BLK_1_0_SHIFT (0U)
/*! GEN_BLK_1_0 - GEN_BLK_1 Part 1 */
#define SECCON_GENERAL_BLOCK_1_0_GEN_BLK_1_0(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_1_0_GEN_BLK_1_0_SHIFT)) & SECCON_GENERAL_BLOCK_1_0_GEN_BLK_1_0_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_1_1 - GEN_BLK_1_1 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_1_1_GEN_BLK_1_1_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_1_1_GEN_BLK_1_1_SHIFT (0U)
/*! GEN_BLK_1_1 - GEN_BLK_1 Part 1 */
#define SECCON_GENERAL_BLOCK_1_1_GEN_BLK_1_1(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_1_1_GEN_BLK_1_1_SHIFT)) & SECCON_GENERAL_BLOCK_1_1_GEN_BLK_1_1_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_1_2 - GEN_BLK_1_2 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_1_2_GEN_BLK_1_2_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_1_2_GEN_BLK_1_2_SHIFT (0U)
/*! GEN_BLK_1_2 - GEN_BLK_1 Part 2 */
#define SECCON_GENERAL_BLOCK_1_2_GEN_BLK_1_2(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_1_2_GEN_BLK_1_2_SHIFT)) & SECCON_GENERAL_BLOCK_1_2_GEN_BLK_1_2_MASK)
/*! @} */

/*! @name GENERAL_BLOCK_1_3 - GEN_BLK_1_3 */
/*! @{ */

#define SECCON_GENERAL_BLOCK_1_3_GEN_BLK_1_3_MASK (0xFFFFFFFFU)
#define SECCON_GENERAL_BLOCK_1_3_GEN_BLK_1_3_SHIFT (0U)
/*! GEN_BLK_1_3 - GEN_BLK_1 Part 3 */
#define SECCON_GENERAL_BLOCK_1_3_GEN_BLK_1_3(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_GENERAL_BLOCK_1_3_GEN_BLK_1_3_SHIFT)) & SECCON_GENERAL_BLOCK_1_3_GEN_BLK_1_3_MASK)
/*! @} */

/*! @name DEVICE_UID_0 - Device UID 0 */
/*! @{ */

#define SECCON_DEVICE_UID_0_UID0_MASK            (0xFFFFFFFFU)
#define SECCON_DEVICE_UID_0_UID0_SHIFT           (0U)
/*! UID0 - Device Unique ID part 0 */
#define SECCON_DEVICE_UID_0_UID0(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_DEVICE_UID_0_UID0_SHIFT)) & SECCON_DEVICE_UID_0_UID0_MASK)
/*! @} */

/*! @name DEVICE_UID_1 - Device UID 1 */
/*! @{ */

#define SECCON_DEVICE_UID_1_UID1_MASK            (0xFFFFFFFFU)
#define SECCON_DEVICE_UID_1_UID1_SHIFT           (0U)
/*! UID1 - Device Unique ID part 1 */
#define SECCON_DEVICE_UID_1_UID1(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_DEVICE_UID_1_UID1_SHIFT)) & SECCON_DEVICE_UID_1_UID1_MASK)
/*! @} */

/*! @name DEVICE_UID_2 - Device UID 2 */
/*! @{ */

#define SECCON_DEVICE_UID_2_UID2_MASK            (0xFFFFFFFFU)
#define SECCON_DEVICE_UID_2_UID2_SHIFT           (0U)
/*! UID2 - Device Unique ID part 2 */
#define SECCON_DEVICE_UID_2_UID2(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_DEVICE_UID_2_UID2_SHIFT)) & SECCON_DEVICE_UID_2_UID2_MASK)
/*! @} */

/*! @name DEVICE_UID_3 - Device UID 3 */
/*! @{ */

#define SECCON_DEVICE_UID_3_UID3_MASK            (0xFFFFFFFFU)
#define SECCON_DEVICE_UID_3_UID3_SHIFT           (0U)
/*! UID3 - Device Unique ID part 3 */
#define SECCON_DEVICE_UID_3_UID3(x)              (((uint32_t)(((uint32_t)(x)) << SECCON_DEVICE_UID_3_UID3_SHIFT)) & SECCON_DEVICE_UID_3_UID3_MASK)
/*! @} */

/*! @name GDET0_CTRL - GDET0 Control */
/*! @{ */

#define SECCON_GDET0_CTRL_GDET_EVTCNT_CLR_MASK   (0x1U)
#define SECCON_GDET0_CTRL_GDET_EVTCNT_CLR_SHIFT  (0U)
/*! GDET_EVTCNT_CLR - GDET Event Counter Clear
 *  0b0..Not clear
 *  0b1..Clears
 */
#define SECCON_GDET0_CTRL_GDET_EVTCNT_CLR(x)     (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_GDET_EVTCNT_CLR_SHIFT)) & SECCON_GDET0_CTRL_GDET_EVTCNT_CLR_MASK)

