zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SECCON.h
#define SECCON_GDET0_CTRL_GDET_ERR_CLR_MASK      (0x2U)
#define SECCON_GDET0_CTRL_GDET_ERR_CLR_SHIFT     (1U)
/*! GDET_ERR_CLR - GDET Error Clear
 *  0b0..Not clear
 *  0b1..Clears
 */
#define SECCON_GDET0_CTRL_GDET_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_GDET_ERR_CLR_SHIFT)) & SECCON_GDET0_CTRL_GDET_ERR_CLR_MASK)

#define SECCON_GDET0_CTRL_GDET_ISO_CTR_MASK      (0xCU)
#define SECCON_GDET0_CTRL_GDET_ISO_CTR_SHIFT     (2U)
/*! GDET_ISO_CTR - GDET Isolation Control
 *  0b00..Disabled
 *  0b01..Disabled
 *  0b10..Enabled
 *  0b11..Disabled
 */
#define SECCON_GDET0_CTRL_GDET_ISO_CTR(x)        (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_GDET_ISO_CTR_SHIFT)) & SECCON_GDET0_CTRL_GDET_ISO_CTR_MASK)

#define SECCON_GDET0_CTRL_EVENT_CNT_MASK         (0xFF0000U)
#define SECCON_GDET0_CTRL_EVENT_CNT_SHIFT        (16U)
/*! EVENT_CNT - Event Count Value */
#define SECCON_GDET0_CTRL_EVENT_CNT(x)           (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_EVENT_CNT_SHIFT)) & SECCON_GDET0_CTRL_EVENT_CNT_MASK)

#define SECCON_GDET0_CTRL_POS_SYNC_MASK          (0x1000000U)
#define SECCON_GDET0_CTRL_POS_SYNC_SHIFT         (24U)
/*! POS_SYNC - Positive Glitch Detection
 *  0b0..Not detected
 *  0b1..Detected
 */
#define SECCON_GDET0_CTRL_POS_SYNC(x)            (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_POS_SYNC_SHIFT)) & SECCON_GDET0_CTRL_POS_SYNC_MASK)

#define SECCON_GDET0_CTRL_NEG_SYNC_MASK          (0x2000000U)
#define SECCON_GDET0_CTRL_NEG_SYNC_SHIFT         (25U)
/*! NEG_SYNC - Negative Glitch Detection
 *  0b0..Not detected
 *  0b1..Detected
 */
#define SECCON_GDET0_CTRL_NEG_SYNC(x)            (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_NEG_SYNC_SHIFT)) & SECCON_GDET0_CTRL_NEG_SYNC_MASK)

#define SECCON_GDET0_CTRL_EVENT_CLR_FLAG_MASK    (0x4000000U)
#define SECCON_GDET0_CTRL_EVENT_CLR_FLAG_SHIFT   (26U)
/*! EVENT_CLR_FLAG - Event Counter Clear
 *  0b0..Not cleared
 *  0b1..Cleared
 */
#define SECCON_GDET0_CTRL_EVENT_CLR_FLAG(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_GDET0_CTRL_EVENT_CLR_FLAG_SHIFT)) & SECCON_GDET0_CTRL_EVENT_CLR_FLAG_MASK)
/*! @} */

/*! @name CFPA_LC_STATE - OEM Life cycle state. */
/*! @{ */

#define SECCON_CFPA_LC_STATE_CFPA_LC_STATE_MASK  (0xFFU)
#define SECCON_CFPA_LC_STATE_CFPA_LC_STATE_SHIFT (0U)
/*! CFPA_LC_STATE - CFPA_LC_STATE
 *  0b00000011..Develop state
 *  0b00000111..Develop 2 state
 *  0b00001111..In-field state
 *  0b00111111..FA state
 *  0b01011010..Bricked stated
 *  0b11001111..In-field locked state
 */
#define SECCON_CFPA_LC_STATE_CFPA_LC_STATE(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CFPA_LC_STATE_CFPA_LC_STATE_SHIFT)) & SECCON_CFPA_LC_STATE_CFPA_LC_STATE_MASK)

#define SECCON_CFPA_LC_STATE_INV_CFPA_LC_STATE_MASK (0xFF00U)
#define SECCON_CFPA_LC_STATE_INV_CFPA_LC_STATE_SHIFT (8U)
/*! INV_CFPA_LC_STATE - INV_CFPA_LC_STATE
 *  0b00110000..In-field locked state
 *  0b10100101..Bricked stated
 *  0b11000000..FA state
 *  0b11110000..In-field state
 *  0b11111000..Develop 2 state
 *  0b11111100..Develop state
 */
#define SECCON_CFPA_LC_STATE_INV_CFPA_LC_STATE(x) (((uint32_t)(((uint32_t)(x)) << SECCON_CFPA_LC_STATE_INV_CFPA_LC_STATE_SHIFT)) & SECCON_CFPA_LC_STATE_INV_CFPA_LC_STATE_MASK)

#define SECCON_CFPA_LC_STATE_CFPA_HEADER_MASK    (0xFFFF0000U)
#define SECCON_CFPA_LC_STATE_CFPA_HEADER_SHIFT   (16U)
/*! CFPA_HEADER - CFPA_HEADER
 *  0b1001011000110101..valid CFPA header, any other value will be invalid
 */
#define SECCON_CFPA_LC_STATE_CFPA_HEADER(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_CFPA_LC_STATE_CFPA_HEADER_SHIFT)) & SECCON_CFPA_LC_STATE_CFPA_HEADER_MASK)
/*! @} */

/*! @name LIFECYCLE_STATE - Chip LifeCycle State */
/*! @{ */

#define SECCON_LIFECYCLE_STATE_CHIP_LC_STATE_MASK (0xFFU)
#define SECCON_LIFECYCLE_STATE_CHIP_LC_STATE_SHIFT (0U)
/*! CHIP_LC_STATE - Chip LifeCycle State
 *  0b00000000..NXP_BLANK
 *  0b00000001..NXP_FAB
 *  0b00000011..DEVELOP
 *  0b00000111..DEVELOP_2
 *  0b00001111..IN_FIELD
 *  0b00011111..OEM_FIELD_RETURN
 *  0b01111111..NXP_FA
 *  0b11001111..IN_FIELD_LOCKED
 *  0b11111100..NXP_DEV
 *  0b11111111..BRICKED
 */
#define SECCON_LIFECYCLE_STATE_CHIP_LC_STATE(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_LIFECYCLE_STATE_CHIP_LC_STATE_SHIFT)) & SECCON_LIFECYCLE_STATE_CHIP_LC_STATE_MASK)
/*! @} */

/*! @name INV_LIFECYCLE_STATE - Invert version of LIFECYCLE_STATE */
/*! @{ */

#define SECCON_INV_LIFECYCLE_STATE_INV_CHIP_LC_STATE_MASK (0xFFU)
#define SECCON_INV_LIFECYCLE_STATE_INV_CHIP_LC_STATE_SHIFT (0U)
#define SECCON_INV_LIFECYCLE_STATE_INV_CHIP_LC_STATE(x) (((uint32_t)(((uint32_t)(x)) << SECCON_INV_LIFECYCLE_STATE_INV_CHIP_LC_STATE_SHIFT)) & SECCON_INV_LIFECYCLE_STATE_INV_CHIP_LC_STATE_MASK)
/*! @} */

/*! @name CPU0_DEBUG_EN - Debug Feature Registers for CPU0 */
/*! @{ */

#define SECCON_CPU0_DEBUG_EN_CPU0_DBGEN_MASK     (0x3U)
#define SECCON_CPU0_DEBUG_EN_CPU0_DBGEN_SHIFT    (0U)
/*! CPU0_DBGEN - CPU0 invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_CPU0_DBGEN(x)       (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_CPU0_DBGEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_CPU0_DBGEN_MASK)

#define SECCON_CPU0_DEBUG_EN_CPU0_NIDEN_MASK     (0xCU)
#define SECCON_CPU0_DEBUG_EN_CPU0_NIDEN_SHIFT    (2U)
/*! CPU0_NIDEN - CPU0 non-invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_CPU0_NIDEN(x)       (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_CPU0_NIDEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_CPU0_NIDEN_MASK)

#define SECCON_CPU0_DEBUG_EN_CPU0_SPIDEN_MASK    (0x30U)
#define SECCON_CPU0_DEBUG_EN_CPU0_SPIDEN_SHIFT   (4U)
/*! CPU0_SPIDEN - CPU0 secure privileged invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_CPU0_SPIDEN(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_CPU0_SPIDEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_CPU0_SPIDEN_MASK)

#define SECCON_CPU0_DEBUG_EN_CPU0_SPNIDEN_MASK   (0xC0U)
#define SECCON_CPU0_DEBUG_EN_CPU0_SPNIDEN_SHIFT  (6U)
/*! CPU0_SPNIDEN - CPU0 secure privileged non-invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_CPU0_SPNIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_CPU0_SPNIDEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_CPU0_SPNIDEN_MASK)
/*! @} */

