zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SECCON.h
/*! @name CPU0_DEBUG_EN_DP - Debug Feature Registers for CPU0 (duplicate) */
/*! @{ */

#define SECCON_CPU0_DEBUG_EN_DP_CPU0_DBGEN_MASK  (0x3U)
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_DBGEN_SHIFT (0U)
/*! CPU0_DBGEN - CPU0 invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_DBGEN(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_DP_CPU0_DBGEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_DP_CPU0_DBGEN_MASK)

#define SECCON_CPU0_DEBUG_EN_DP_CPU0_NIDEN_MASK  (0xCU)
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_NIDEN_SHIFT (2U)
/*! CPU0_NIDEN - CPU0 non-invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_NIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_DP_CPU0_NIDEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_DP_CPU0_NIDEN_MASK)

#define SECCON_CPU0_DEBUG_EN_DP_CPU0_SPIDEN_MASK (0x30U)
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_SPIDEN_SHIFT (4U)
/*! CPU0_SPIDEN - CPU0 secure privileged invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_SPIDEN(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_DP_CPU0_SPIDEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_DP_CPU0_SPIDEN_MASK)

#define SECCON_CPU0_DEBUG_EN_DP_CPU0_SPNIDEN_MASK (0xC0U)
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_SPNIDEN_SHIFT (6U)
/*! CPU0_SPNIDEN - CPU0 secure privileged non-invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU0_DEBUG_EN_DP_CPU0_SPNIDEN(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_EN_DP_CPU0_SPNIDEN_SHIFT)) & SECCON_CPU0_DEBUG_EN_DP_CPU0_SPNIDEN_MASK)
/*! @} */

/*! @name CPU1_DEBUG_EN - Debug Feature Registers for CPU1 */
/*! @{ */

#define SECCON_CPU1_DEBUG_EN_CPU1_DBGEN_MASK     (0x3U)
#define SECCON_CPU1_DEBUG_EN_CPU1_DBGEN_SHIFT    (0U)
/*! CPU1_DBGEN - CPU1 invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU1_DEBUG_EN_CPU1_DBGEN(x)       (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_DEBUG_EN_CPU1_DBGEN_SHIFT)) & SECCON_CPU1_DEBUG_EN_CPU1_DBGEN_MASK)

#define SECCON_CPU1_DEBUG_EN_CPU1_NIDEN_MASK     (0xCU)
#define SECCON_CPU1_DEBUG_EN_CPU1_NIDEN_SHIFT    (2U)
/*! CPU1_NIDEN - CPU1 non-invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU1_DEBUG_EN_CPU1_NIDEN(x)       (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_DEBUG_EN_CPU1_NIDEN_SHIFT)) & SECCON_CPU1_DEBUG_EN_CPU1_NIDEN_MASK)
/*! @} */

/*! @name CPU1_DEBUG_EN_DP - Debug Feature Registers for CPU1 (duplicate) */
/*! @{ */

#define SECCON_CPU1_DEBUG_EN_DP_CPU1_DBGEN_MASK  (0x3U)
#define SECCON_CPU1_DEBUG_EN_DP_CPU1_DBGEN_SHIFT (0U)
/*! CPU1_DBGEN - CPU1 invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU1_DEBUG_EN_DP_CPU1_DBGEN(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_DEBUG_EN_DP_CPU1_DBGEN_SHIFT)) & SECCON_CPU1_DEBUG_EN_DP_CPU1_DBGEN_MASK)

#define SECCON_CPU1_DEBUG_EN_DP_CPU1_NIDEN_MASK  (0xCU)
#define SECCON_CPU1_DEBUG_EN_DP_CPU1_NIDEN_SHIFT (2U)
/*! CPU1_NIDEN - CPU1 non-invasive debug control
 *  0b00..Disables debug
 *  0b01..Disables debug
 *  0b10..Enables debug
 *  0b11..Not Allow
 */
#define SECCON_CPU1_DEBUG_EN_DP_CPU1_NIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CPU1_DEBUG_EN_DP_CPU1_NIDEN_SHIFT)) & SECCON_CPU1_DEBUG_EN_DP_CPU1_NIDEN_MASK)
/*! @} */

/*! @name DEBUG_AUTH_BEACON - Debug Authentication BEACON */
/*! @{ */

#define SECCON_DEBUG_AUTH_BEACON_BEACON_MASK     (0xFFFFFFFFU)
#define SECCON_DEBUG_AUTH_BEACON_BEACON_SHIFT    (0U)
/*! BEACON - Sets by the debug authentication code in ROM to pass the debug beacons (Credential
 *    Beacon and Authentication Beacon) to the application code.
 */
#define SECCON_DEBUG_AUTH_BEACON_BEACON(x)       (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_AUTH_BEACON_BEACON_SHIFT)) & SECCON_DEBUG_AUTH_BEACON_BEACON_MASK)
/*! @} */

/*! @name DEBUG_FEATURE_LOCK - Controls write access to Debug Security registers */
/*! @{ */

#define SECCON_DEBUG_FEATURE_LOCK_CPU0_DBGEN_LOCK_MASK (0xFU)
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_DBGEN_LOCK_SHIFT (0U)
/*! CPU0_DBGEN_LOCK - Controls write access to the CPU0 invasive debug control
 *  0b1010..Enables write access to all registers, any other value rather than 4'b1010 will disable write access
 *          to all registers. Once write value rather than 4'b1010, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_DBGEN_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_CPU0_DBGEN_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_CPU0_DBGEN_LOCK_MASK)

#define SECCON_DEBUG_FEATURE_LOCK_CPU0_NIDEN_LOCK_MASK (0xF0U)
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_NIDEN_LOCK_SHIFT (4U)
/*! CPU0_NIDEN_LOCK - Controls write access to the CPU0 non-invasive debug control
 *  0b1010..Enables write access to all registers, any other value rather than 4'b1010 will disable write access
 *          to all registers. Once value other than 4'b1010 is written, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_NIDEN_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_CPU0_NIDEN_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_CPU0_NIDEN_LOCK_MASK)

#define SECCON_DEBUG_FEATURE_LOCK_CPU0_SPIDEN_LOCK_MASK (0xF00U)
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_SPIDEN_LOCK_SHIFT (8U)
/*! CPU0_SPIDEN_LOCK - Controls write access to the CPU0 secure privileged invasive debug control
 *  0b1010..Enables write access to all registers, any other value rather than 4'b1010 will disable write access
 *          to all registers. Once value other than 4'b1010 is written, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_SPIDEN_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_CPU0_SPIDEN_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_CPU0_SPIDEN_LOCK_MASK)

#define SECCON_DEBUG_FEATURE_LOCK_CPU0_SPNIDEN_LOCK_MASK (0xF000U)
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_SPNIDEN_LOCK_SHIFT (12U)
/*! CPU0_SPNIDEN_LOCK - Controls write access to the CPU0 secure privileged non-invasive debug control
 *  0b1010..Enables write access to all registers, any other value rather than 4'b1010 will disable write access
 *          to all registers. Once value other than 4'b1010 is written, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_CPU0_SPNIDEN_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_CPU0_SPNIDEN_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_CPU0_SPNIDEN_LOCK_MASK)

#define SECCON_DEBUG_FEATURE_LOCK_CPU1_DBGEN_LOCK_MASK (0xF0000U)
#define SECCON_DEBUG_FEATURE_LOCK_CPU1_DBGEN_LOCK_SHIFT (16U)
/*! CPU1_DBGEN_LOCK - Controls write access to the CPU1 debug related registers
 *  0b1010..Enables write access to all registers, any other value rather than 4'b1010 will disable write access
 *          to all registers. Once value other than 4'b1010 is written, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_CPU1_DBGEN_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_CPU1_DBGEN_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_CPU1_DBGEN_LOCK_MASK)

