zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SECCON.h
#define SECCON_DEBUG_FEATURE_LOCK_CPU1_NIDEN_LOCK_MASK (0xF00000U)
#define SECCON_DEBUG_FEATURE_LOCK_CPU1_NIDEN_LOCK_SHIFT (20U)
/*! CPU1_NIDEN_LOCK - Controls write access to the CPU1 debug related registers
 *  0b1010..Enables write access to all registers, any other value rather than 4'b1010 will disable write access
 *          to all registers. Once value other than 4'b1010 is written, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_CPU1_NIDEN_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_CPU1_NIDEN_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_CPU1_NIDEN_LOCK_MASK)

#define SECCON_DEBUG_FEATURE_LOCK_DEBUG_AUTH_BEACON_LOCK_MASK (0xF0000000U)
#define SECCON_DEBUG_FEATURE_LOCK_DEBUG_AUTH_BEACON_LOCK_SHIFT (28U)
/*! DEBUG_AUTH_BEACON_LOCK - Controls write access to the DEBUG_AUTH_BEACON
 *  0b1010..Enables write access to DEBUG_AUTH_BEACON registers, any other value rather than 4'b1010 will disable
 *          write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.
 */
#define SECCON_DEBUG_FEATURE_LOCK_DEBUG_AUTH_BEACON_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_DEBUG_FEATURE_LOCK_DEBUG_AUTH_BEACON_LOCK_SHIFT)) & SECCON_DEBUG_FEATURE_LOCK_DEBUG_AUTH_BEACON_LOCK_MASK)
/*! @} */

/*! @name SWD_ACCESS_CPU0 - CPU0 Software Debug Access */
/*! @{ */

#define SECCON_SWD_ACCESS_CPU0_CPU0_SWD_ACCESS_ENABLE_MASK (0xFU)
#define SECCON_SWD_ACCESS_CPU0_CPU0_SWD_ACCESS_ENABLE_SHIFT (0U)
/*! CPU0_SWD_ACCESS_ENABLE - CPU0 SWD AP Access Control
 *  0b1010..Access Enable, any other value means access disable
 */
#define SECCON_SWD_ACCESS_CPU0_CPU0_SWD_ACCESS_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SECCON_SWD_ACCESS_CPU0_CPU0_SWD_ACCESS_ENABLE_SHIFT)) & SECCON_SWD_ACCESS_CPU0_CPU0_SWD_ACCESS_ENABLE_MASK)
/*! @} */

/*! @name SWD_ACCESS_CPU1 - CPU1 Software Debug Access */
/*! @{ */

#define SECCON_SWD_ACCESS_CPU1_CPU1_SWD_ACCESS_ENABLE_MASK (0xFU)
#define SECCON_SWD_ACCESS_CPU1_CPU1_SWD_ACCESS_ENABLE_SHIFT (0U)
/*! CPU1_SWD_ACCESS_ENABLE - CPU1 SWD AP Access Control
 *  0b1010..Access Enable, any other value means access disable
 */
#define SECCON_SWD_ACCESS_CPU1_CPU1_SWD_ACCESS_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SECCON_SWD_ACCESS_CPU1_CPU1_SWD_ACCESS_ENABLE_SHIFT)) & SECCON_SWD_ACCESS_CPU1_CPU1_SWD_ACCESS_ENABLE_MASK)
/*! @} */

/*! @name SOC_ERSIEN - Flash IFR0 Erase Enable */
/*! @{ */

#define SECCON_SOC_ERSIEN_SECTOR_0_ERASE_EN_MASK (0xFU)
#define SECCON_SOC_ERSIEN_SECTOR_0_ERASE_EN_SHIFT (0U)
/*! SECTOR_0_ERASE_EN - Erase IFR Sector Enable - Block 0
 *  0b0000..Block 0 IFR Sector X is protected from erase by ERSSCR command
 *  0b0001..Block 0 IFR Sector X is not protected from erase by ERSSCR command
 */
#define SECCON_SOC_ERSIEN_SECTOR_0_ERASE_EN(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_SOC_ERSIEN_SECTOR_0_ERASE_EN_SHIFT)) & SECCON_SOC_ERSIEN_SECTOR_0_ERASE_EN_MASK)

#define SECCON_SOC_ERSIEN_SECTOR_1_ERASE_EN_MASK (0xF0U)
#define SECCON_SOC_ERSIEN_SECTOR_1_ERASE_EN_SHIFT (4U)
/*! SECTOR_1_ERASE_EN - Erase IFR Sector Enable - Block 1 (for dual block configs)
 *  0b0000..Block 1 IFR Sector X is protected from erase by ERSSCR command
 *  0b0001..Block 1 IFR Sector X is not protected from erase by ERSSCR command
 */
#define SECCON_SOC_ERSIEN_SECTOR_1_ERASE_EN(x)   (((uint32_t)(((uint32_t)(x)) << SECCON_SOC_ERSIEN_SECTOR_1_ERASE_EN_SHIFT)) & SECCON_SOC_ERSIEN_SECTOR_1_ERASE_EN_MASK)

#define SECCON_SOC_ERSIEN_MASS_ERASE_EN_MASK     (0x100U)
#define SECCON_SOC_ERSIEN_MASS_ERASE_EN_SHIFT    (8U)
/*! MASS_ERASE_EN - Mass erase control
 *  0b0..Disables mass erase
 *  0b1..Enables mass erase
 */
#define SECCON_SOC_ERSIEN_MASS_ERASE_EN(x)       (((uint32_t)(((uint32_t)(x)) << SECCON_SOC_ERSIEN_MASS_ERASE_EN_SHIFT)) & SECCON_SOC_ERSIEN_MASS_ERASE_EN_MASK)
/*! @} */

/*! @name BOOT_RETRY_CNT - Boot Retry Counter */
/*! @{ */

#define SECCON_BOOT_RETRY_CNT_BOOT_RETRY_CNT_MASK (0xFU)
#define SECCON_BOOT_RETRY_CNT_BOOT_RETRY_CNT_SHIFT (0U)
/*! BOOT_RETRY_CNT - Boot retry counter bit. */
#define SECCON_BOOT_RETRY_CNT_BOOT_RETRY_CNT(x)  (((uint32_t)(((uint32_t)(x)) << SECCON_BOOT_RETRY_CNT_BOOT_RETRY_CNT_SHIFT)) & SECCON_BOOT_RETRY_CNT_BOOT_RETRY_CNT_MASK)
/*! @} */

/*! @name BOOT_TEMP_STATE - Boot Temporal State */
/*! @{ */

#define SECCON_BOOT_TEMP_STATE_BOOT_TEMP_STATE_CNT_MASK (0xFU)
#define SECCON_BOOT_TEMP_STATE_BOOT_TEMP_STATE_CNT_SHIFT (0U)
/*! BOOT_TEMP_STATE_CNT - Temporal state counter bit. */
#define SECCON_BOOT_TEMP_STATE_BOOT_TEMP_STATE_CNT(x) (((uint32_t)(((uint32_t)(x)) << SECCON_BOOT_TEMP_STATE_BOOT_TEMP_STATE_CNT_SHIFT)) & SECCON_BOOT_TEMP_STATE_BOOT_TEMP_STATE_CNT_MASK)
/*! @} */

/*! @name BOOT_STATE_0 - Store boot state */
/*! @{ */

#define SECCON_BOOT_STATE_0_BOOT_STATE_0_MASK    (0xFFFFFFFFU)
#define SECCON_BOOT_STATE_0_BOOT_STATE_0_SHIFT   (0U)
/*! BOOT_STATE_0 - BOOT STATE 0 */
#define SECCON_BOOT_STATE_0_BOOT_STATE_0(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_BOOT_STATE_0_BOOT_STATE_0_SHIFT)) & SECCON_BOOT_STATE_0_BOOT_STATE_0_MASK)
/*! @} */

/*! @name BOOT_STATE_1 - Store boot state */
/*! @{ */

#define SECCON_BOOT_STATE_1_BOOT_STATE_1_MASK    (0xFFFFFFFFU)
#define SECCON_BOOT_STATE_1_BOOT_STATE_1_SHIFT   (0U)
/*! BOOT_STATE_1 - BOOT STATE 1 */
#define SECCON_BOOT_STATE_1_BOOT_STATE_1(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_BOOT_STATE_1_BOOT_STATE_1_SHIFT)) & SECCON_BOOT_STATE_1_BOOT_STATE_1_MASK)
/*! @} */

/*! @name BOOT_STATE_2 - Store boot state */
/*! @{ */

#define SECCON_BOOT_STATE_2_BOOT_STATE_2_MASK    (0xFFFFFFFFU)
#define SECCON_BOOT_STATE_2_BOOT_STATE_2_SHIFT   (0U)
/*! BOOT_STATE_2 - BOOT STATE 2 */
#define SECCON_BOOT_STATE_2_BOOT_STATE_2(x)      (((uint32_t)(((uint32_t)(x)) << SECCON_BOOT_STATE_2_BOOT_STATE_2_SHIFT)) & SECCON_BOOT_STATE_2_BOOT_STATE_2_MASK)
/*! @} */

/*! @name BOOT_STATE_LOCK - Boot State Register Lock */
/*! @{ */

#define SECCON_BOOT_STATE_LOCK_BOOT_STATE_LOCK_MASK (0xFU)
#define SECCON_BOOT_STATE_LOCK_BOOT_STATE_LOCK_SHIFT (0U)
/*! BOOT_STATE_LOCK - BOOT STATE REG LOCK
 *  0b1010..Allow write to BOOT_STATE_x, any other value locks this register as well as BOOT_STATE_x's write permission
 */
#define SECCON_BOOT_STATE_LOCK_BOOT_STATE_LOCK(x) (((uint32_t)(((uint32_t)(x)) << SECCON_BOOT_STATE_LOCK_BOOT_STATE_LOCK_SHIFT)) & SECCON_BOOT_STATE_LOCK_BOOT_STATE_LOCK_MASK)
/*! @} */

/*! @name ROM_SCRATCH_PAD_0 - Scratchpad Register 0 */
/*! @{ */

#define SECCON_ROM_SCRATCH_PAD_0_ROM_SCRATCH_PAD_0_MASK (0xFFFFFFFFU)
#define SECCON_ROM_SCRATCH_PAD_0_ROM_SCRATCH_PAD_0_SHIFT (0U)
/*! ROM_SCRATCH_PAD_0 - ROM SCRATCH PAD 0 */
#define SECCON_ROM_SCRATCH_PAD_0_ROM_SCRATCH_PAD_0(x) (((uint32_t)(((uint32_t)(x)) << SECCON_ROM_SCRATCH_PAD_0_ROM_SCRATCH_PAD_0_SHIFT)) & SECCON_ROM_SCRATCH_PAD_0_ROM_SCRATCH_PAD_0_MASK)
/*! @} */

/*! @name ROM_SCRATCH_PAD_1 - Scratchpad Register 1 */
/*! @{ */

#define SECCON_ROM_SCRATCH_PAD_1_ROM_SCRATCH_PAD_1_MASK (0xFFFFFFFFU)
#define SECCON_ROM_SCRATCH_PAD_1_ROM_SCRATCH_PAD_1_SHIFT (0U)
/*! ROM_SCRATCH_PAD_1 - ROM SCRATCH PAD 1 */
#define SECCON_ROM_SCRATCH_PAD_1_ROM_SCRATCH_PAD_1(x) (((uint32_t)(((uint32_t)(x)) << SECCON_ROM_SCRATCH_PAD_1_ROM_SCRATCH_PAD_1_SHIFT)) & SECCON_ROM_SCRATCH_PAD_1_ROM_SCRATCH_PAD_1_MASK)
/*! @} */

/*! @name ROM_API_PARAM - ROM API PARAM */
/*! @{ */

#define SECCON_ROM_API_PARAM_ROM_API_PARAM_MASK  (0xFFFFFFFFU)
#define SECCON_ROM_API_PARAM_ROM_API_PARAM_SHIFT (0U)
/*! ROM_API_PARAM - ROM API PARAM */
#define SECCON_ROM_API_PARAM_ROM_API_PARAM(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_ROM_API_PARAM_ROM_API_PARAM_SHIFT)) & SECCON_ROM_API_PARAM_ROM_API_PARAM_MASK)
/*! @} */

/*! @name RECOVERY_IMAGE_VECTOR - RECOVERY IMAGE VECTOR */
/*! @{ */

#define SECCON_RECOVERY_IMAGE_VECTOR_RECOVERY_IMAGE_VECTOR_MASK (0xFFFFFFFFU)
#define SECCON_RECOVERY_IMAGE_VECTOR_RECOVERY_IMAGE_VECTOR_SHIFT (0U)
/*! RECOVERY_IMAGE_VECTOR - RECOVERY IMAGE VECTOR */
#define SECCON_RECOVERY_IMAGE_VECTOR_RECOVERY_IMAGE_VECTOR(x) (((uint32_t)(((uint32_t)(x)) << SECCON_RECOVERY_IMAGE_VECTOR_RECOVERY_IMAGE_VECTOR_SHIFT)) & SECCON_RECOVERY_IMAGE_VECTOR_RECOVERY_IMAGE_VECTOR_MASK)
/*! @} */

/*! @name LP_WAKEUP_VECTOR - LP WAKEUP VECTOR */
/*! @{ */

#define SECCON_LP_WAKEUP_VECTOR_LP_WAKEUP_VECTOR_MASK (0xFFFFFFFFU)
#define SECCON_LP_WAKEUP_VECTOR_LP_WAKEUP_VECTOR_SHIFT (0U)
/*! LP_WAKEUP_VECTOR - LP WAKEUP VECTOR */
#define SECCON_LP_WAKEUP_VECTOR_LP_WAKEUP_VECTOR(x) (((uint32_t)(((uint32_t)(x)) << SECCON_LP_WAKEUP_VECTOR_LP_WAKEUP_VECTOR_SHIFT)) & SECCON_LP_WAKEUP_VECTOR_LP_WAKEUP_VECTOR_MASK)
/*! @} */

/*! @name NXP_PROV_FW_RUN - NXP PROV FW RUN */
/*! @{ */

#define SECCON_NXP_PROV_FW_RUN_NXP_PROV_FW_RUN_MASK (0xFFFFFFFFU)
#define SECCON_NXP_PROV_FW_RUN_NXP_PROV_FW_RUN_SHIFT (0U)
/*! NXP_PROV_FW_RUN - NXP PROV FW RUN */
#define SECCON_NXP_PROV_FW_RUN_NXP_PROV_FW_RUN(x) (((uint32_t)(((uint32_t)(x)) << SECCON_NXP_PROV_FW_RUN_NXP_PROV_FW_RUN_SHIFT)) & SECCON_NXP_PROV_FW_RUN_NXP_PROV_FW_RUN_MASK)
/*! @} */

