zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SECCON.h
/*! @name SPI_FLASH_RECOVERY - SPI FLASH RECOVERY */
/*! @{ */

#define SECCON_SPI_FLASH_RECOVERY_SPI_FLASH_RECOVERY_MASK (0xFFFFFFFFU)
#define SECCON_SPI_FLASH_RECOVERY_SPI_FLASH_RECOVERY_SHIFT (0U)
/*! SPI_FLASH_RECOVERY - SPI FLASH RECOVERY */
#define SECCON_SPI_FLASH_RECOVERY_SPI_FLASH_RECOVERY(x) (((uint32_t)(((uint32_t)(x)) << SECCON_SPI_FLASH_RECOVERY_SPI_FLASH_RECOVERY_SHIFT)) & SECCON_SPI_FLASH_RECOVERY_SPI_FLASH_RECOVERY_MASK)
/*! @} */

/*! @name SPARE - SPARE */
/*! @{ */

#define SECCON_SPARE_SPARE_MASK                  (0xFFFFFFFFU)
#define SECCON_SPARE_SPARE_SHIFT                 (0U)
/*! SPARE - SPARE */
#define SECCON_SPARE_SPARE(x)                    (((uint32_t)(((uint32_t)(x)) << SECCON_SPARE_SPARE_SHIFT)) & SECCON_SPARE_SPARE_MASK)
/*! @} */

/*! @name CPU0_DEBUG_PRE - CPU0 Debug Preparation */
/*! @{ */

#define SECCON_CPU0_DEBUG_PRE_CPU0_STC_REG_MASK  (0xFFFFFFFFU)
#define SECCON_CPU0_DEBUG_PRE_CPU0_STC_REG_SHIFT (0U)
/*! CPU0_STC_REG - Debug Preparation */
#define SECCON_CPU0_DEBUG_PRE_CPU0_STC_REG(x)    (((uint32_t)(((uint32_t)(x)) << SECCON_CPU0_DEBUG_PRE_CPU0_STC_REG_SHIFT)) & SECCON_CPU0_DEBUG_PRE_CPU0_STC_REG_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SECCON_Register_Masks */

/**
 * @brief Get the unique silicon identifier (UID) from the device
 *
 * This function reads the 128-bit unique device identifier from the SECCON
 * peripheral's DEVICE_UID registers and copies it to the provided buffer.
 * The UID is extracted directly from hardware registers without using any
 * standard library functions.
 *
 * @details The function reads four 32-bit registers (DEVICE_UID_0 through
 *          DEVICE_UID_3) and converts them to a 16-byte array in little-endian
 *          format. Each 32-bit register is broken down into 4 bytes with the
 *          least significant byte first.
 *
 * @param[out] aOutUid16B   Pointer to a buffer that will receive the 16-byte UID.
 *                          Must be at least 16 bytes in size. Caller must ensure it is not NULL.
 * @param[out] pOutLen      Pointer to a variable that will receive the length
 *                          of the UID in bytes (always 16). Caller must ensure it is not NULL.
 *
 * @return None
 */
static inline void Chip_GetUID(uint8_t *aOutUid16B, uint8_t *pOutLen)
{
    union {
        uint32_t words[4];
        uint8_t bytes[16];
    } uid;
    uint8_t i;

    /* Get the MCU uid */
    uid.words[0] = SECCON->DEVICE_UID_0;
    uid.words[1] = SECCON->DEVICE_UID_1;
    uid.words[2] = SECCON->DEVICE_UID_2;
    uid.words[3] = SECCON->DEVICE_UID_3;

    /* Copy bytes */
    for (i = 0U; i < 16U; i++)
    {
        aOutUid16B[i] = uid.bytes[i];
    }

    /* Get the uid length */
    *pOutLen = 16U;
}


/*!
 * @}
 */ /* end of group SECCON_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SECCON_H_ */

